---
kind: type
id: T:Autodesk.Revit.DB.Architecture.BuildingPad
source: html/1e6c34f0-5ada-fb65-d218-b8f8feaad68d.htm
---
# Autodesk.Revit.DB.Architecture.BuildingPad

Represents a BuildingPad element.

## Syntax (C#)
```csharp
public class BuildingPad : CeilingAndFloor
```